[
  {
    "company": "Check24 Vergleich GmbH",
    "position": "Senior Android Engineer",
    "location": "Munich, Germany",
    "period": "Sep 2022 – Present",
    "responsibilities": [
      "Developed loan comparison features using Kotlin, Jetpack Compose, MVVM/MVI, and Dagger.",
      "Refactored a large legacy codebase into a scalable multi-module architecture with full test coverage.",
      "Built integration layers for Spring Boot microservices and REST APIs.",
      "Delivered a cross-platform automation framework using Appium, Selenium, and Java.",
      "Contributed to iOS features using Swift, UIKit, and SwiftUI.",
      "Maintained CI/CD systems across Docker, Kubernetes, Jenkins, and GitHub Actions.",
      "Collaborated in Agile teams on architecture, planning, and code reviews."
    ]
  },
  {
    "company": "Evntoo",
    "position": "Senior Android Engineer",
    "location": "Cairo, Egypt",
    "period": "Dec 2020 – Sep 2022",
    "responsibilities": [
      "Developed User & Provider apps using Kotlin, MVVM, Room, RxKotlin, and Firebase.",
      "Implemented payment gateways, encrypted storage, and location-based features.",
      "Built automated CI/CD pipelines using Jenkins and Docker.",
      "Improved reliability through unit and UI test coverage."
    ]
  },
  {
    "company": "Julfar Consultancy Services",
    "position": "Senior Android Engineer",
    "location": "Cairo, Egypt",
    "period": "Feb 2019 – Dec 2020",
    "responsibilities": [
      "Built enterprise and government apps using Kotlin, Room, Coroutines, SAP, and REST APIs.",
      "Implemented MVI architecture, QR scanning, live chat, and Firebase modules.",
      "Optimized performance for low-end devices and ensured secure API communication.",
      "Delivered high-quality releases with JUnit, Mockito, and Espresso tests."
    ]
  },
  {
    "company": "Felucca",
    "position": "Co-Founder / Part-Time Android Engineer",
    "location": "Cairo, Egypt",
    "period": "Jan 2017 – Mar 2023",
    "responsibilities": [
      "Developed consumer apps, including GreenHub (Kotlin, Firebase, Jetpack) and FocusMusic (Java, MediaPlayer).",
      "Built REST API integrations and secure local storage.",
      "Created local CI pipelines with Docker for testing and builds."
    ]
  },
  {
    "company": "Mawared / Xpress Integration / SpotEG / Freelancer",
    "position": "Android Developer",
    "location": "Egypt",
    "period": "2014 – 2019",
    "responsibilities": [
      "Delivered 15+ Android apps for HR, attendance, and enterprise systems uing Java/Kotlin.",
      "Built SPL Fantasy (fantasy football app – Kotlin, MVVM) and Fingerprint Attendance App (hardware SDKs, ZKteco).",
      "Developed reusable Android libraries including a custom calendar component.",
      "Worked with Retrofit, Maps SDK, POS printer integrations, and embedded hardware.",
      "Implemented robust API integrations, testing practices, and performance optimization."
    ]
  }
]